MikroElektronika/core_packages/ARM/gcc_clang/def/ad/MAX32690/mcu.h
/******************************************************************************
 * Copyright (C) 2023 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32690_INCLUDE_MAX32690_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32690_INCLUDE_MAX32690_H_

#ifndef TARGET_NUM
#define TARGET_NUM 32690
#endif

#define MXC_NUMCORES 1

#include <stdint.h>

#ifndef FALSE
#define FALSE (0)
#endif

#ifndef TRUE
#define TRUE (1)
#endif

/* COMPILER SPECIFIC DEFINES (IAR, ARMCC and GNUC) */
#if defined(__GNUC__)
#define __weak __attribute__((weak))

#elif defined(__CC_ARM)

#define inline __inline
#pragma anon_unions

#endif

typedef enum {
#ifndef __riscv // not RISC-V
    NonMaskableInt_IRQn = -14,
    HardFault_IRQn = -13,
    MemoryManagement_IRQn = -12,
    BusFault_IRQn = -11,
    UsageFault_IRQn = -10,
    SVCall_IRQn = -5,
    DebugMonitor_IRQn = -4,
    PendSV_IRQn = -2,
    SysTick_IRQn = -1,

    /* Device-specific interrupt sources (external to ARM core)                    */
    /*                         table entry number                                  */
    /*                         ||||                                                */
    /*                         ||||  table offset address                          */
    /*                         vvvv  vvvvvv                                        */

    PF_IRQn = 0, /* 0x10  0x0040  16: Power Fail */
    WDT0_IRQn, /* 0x11  0x0044  17: Watchdog 0 */
    USB_IRQn, /* 0x12  0x0048  18: USB */
    RTC_IRQn, /* 0x13  0x004C  19: RTC */
    TRNG_IRQn, /* 0x14  0x0050  20: True Random Number Generator */
    TMR0_IRQn, /* 0x15  0x0054  21: Timer 0 */
    TMR1_IRQn, /* 0x16  0x0058  22: Timer 1 */
    TMR2_IRQn, /* 0x17  0x005C  23: Timer 2 */
    TMR3_IRQn, /* 0x18  0x0060  24: Timer 3 */
    TMR4_IRQn, /* 0x19  0x0064  25: Timer 4 (LP) */
    TMR5_IRQn, /* 0x1A  0x0068  26: Timer 5 (LP) */
    RSV11_IRQn, /* 0x1B  0x006C  27: Reserved */
    RSV12_IRQn, /* 0x1C  0x0070  28: Reserved */
    I2C0_IRQn, /* 0x1D  0x0074  29: I2C0 */
    UART0_IRQn, /* 0x1E  0x0078  30: UART 0 */
    UART1_IRQn, /* 0x1F  0x007C  31: UART 1 */
    SPI0_IRQn, /* 0x20  0x0080  32: SPI0 */
    SPI1_IRQn, /* 0x21  0x0084  33: SPI1 */
    SPI2_IRQn, /* 0x22  0x0088  34: SPI2 */
    RSV19_IRQn, /* 0x23  0x008C  35: Reserved */
    ADC_IRQn, /* 0x24  0x0090  36: ADC */
    RSV21_IRQn, /* 0x25  0x0094  37: Reserved */
    RSV22_IRQn, /* 0x26  0x0098  38: Reserved */
    FLC0_IRQn, /* 0x27  0x009C  39: Flash Controller 0 */
    GPIO0_IRQn, /* 0x28  0x00A0  40: GPIO0 */
    GPIO1_IRQn, /* 0x29  0x00A4  41: GPIO1 */
    GPIO2_IRQn, /* 0x2A  0x00A8  42: GPIO2 */
    CRYPTO_IRQn, /* 0x2B  0x00AC  43: Crypto */
    DMA0_IRQn, /* 0x2C  0x00B0  44: DMA0 */
    DMA1_IRQn, /* 0x2D  0x00B4  45: DMA1 */
    DMA2_IRQn, /* 0x2E  0x00B8  46: DMA2 */
    DMA3_IRQn, /* 0x2F  0x00BC  47: DMA3 */
    RSV32_IRQn, /* 0x30  0x00C0  48: Reserved */
    RSV33_IRQn, /* 0x31  0x00C4  49: Reserved */
    UART2_IRQn, /* 0x32  0x00C8  50: UART 2 */
    RSV35_IRQn, /* 0x33  0x00CC  51: Reserved */
    I2C1_IRQn, /* 0x34  0x00D0  52: I2C1 */
    RSV37_IRQn, /* 0x35  0x00D4  53: Reserved */
    SPIXC_IRQn, /* 0x36  0x00D8  54: SPI execute in place */
    BTLE_TX_DONE_IRQn, /* 0x37  0x00DC  55: BTLE TX Done */
    BTLE_RX_RCVD_IRQn, /* 0x38  0x00E0  56: BTLE RX Received */
    BTLE_RX_ENG_DET_IRQn, /* 0x39  0x00E4  57: BTLE RX Energy Detected */
    BTLE_SFD_DET_IRQn, /* 0x3A  0x00E8  58: BTLE SFD Detected */
    BTLE_SFD_TO_IRQn, /* 0x3B  0x00EC  59: BTLE SFD Timeout*/
    BTLE_GP_EVENT_IRQn, /* 0x3C  0x00F0  60: BTLE Timestamp*/
    BTLE_CFO_IRQn, /* 0x3D  0x00F4  61: BTLE CFO Done */
    BTLE_SIG_DET_IRQn, /* 0x3E  0x00F8  62: BTLE Signal Detected */
    BTLE_AGC_EVENT_IRQn, /* 0x3F  0x00FC  63: BTLE AGC Event */
    BTLE_RFFE_SPIM_IRQn, /* 0x40  0x0100  64: BTLE RFFE SPIM Done */
    BTLE_TX_AES_IRQn, /* 0x41  0x0104  65: BTLE TX AES Done */
    BTLE_RX_AES_IRQn, /* 0x42  0x0108  66: BTLE RX AES Done */
    BTLE_INV_APB_ADDR_IRQn, /* 0x43  0x010C  67: BTLE Invalid APB Address*/
    BTLE_IQ_DATA_VALID_IRQn, /* 0x44  0x0110  68: BTLE IQ Data Valid */
    WUT0_IRQn, /* 0x45  0x0114  69: Wakeup Timer 0 */
    GPIOWAKE_IRQn, /* 0x46  0x0118  70: GPIO and AIN Wakeup */
    RSV55_IRQn, /* 0x47  0x011C  71: Reserved */
    SPI3_IRQn, /* 0x48  0x0120  72: SPI3 */
    WDT1_IRQn, /* 0x49  0x0124  73: LP Watchdog */
    GPIO3_IRQn, /* 0x4A  0x0128  74: GPIO3 */
    PT_IRQn, /* 0x4B  0x012C  75: Pulse Train */
    RSV60_IRQn, /* 0x4C  0x0130  76: Reserved */
    HPB_IRQn, /* 0x4D  0x0134  77: Hyperbus */
    I2C2_IRQn, /* 0x4E  0x0138  78: I2C2 */
    RISCV_IRQn, /* 0x4F  0x013C  79: RISC-V */
    RSV64_IRQn, /* 0x50  0x0140  80: Reserved */
    RSV65_IRQn, /* 0x51  0x0144  81: Reserved */
    RSV66_IRQn, /* 0x52  0x0148  82: Reserved */
    OWM_IRQn, /* 0x53  0x014C  83: One Wire Master */
    DMA4_IRQn, /* 0x54  0x0150  84: DMA4 */
    DMA5_IRQn, /* 0x55  0x0154  85: DMA5 */
    DMA6_IRQn, /* 0x56  0x0158  86: DMA6 */
    DMA7_IRQn, /* 0x57  0x015C  87: DMA7 */
    DMA8_IRQn, /* 0x58  0x0160  88: DMA8 */
    DMA9_IRQn, /* 0x59  0x0164  89: DMA9 */
    DMA10_IRQn, /* 0x5A  0x0168  90: DMA10 */
    DMA11_IRQn, /* 0x5B  0x016C  91: DMA11 */
    DMA12_IRQn, /* 0x5C  0x0170  92: DMA12 */
    DMA13_IRQn, /* 0x5D  0x0174  93: DMA13 */
    DMA14_IRQn, /* 0x5E  0x0178  94: DMA14 */
    DMA15_IRQn, /* 0x5F  0x017C  95: DMA15 */
    USBDMA_IRQn, /* 0x60  0x0180  96: USB DMA */
    RSV81_IRQn, /* 0x61  0x0184  97: Reserved */
    ECC_IRQn, /* 0x62  0x0188  98: ECC */
    RSV83_IRQn, /* 0x63  0x018C  99: Reserved */
    RSV84_IRQn, /* 0x64  0x0190 100: Resevred */
    SCA_IRQn, /* 0x65  0x0194 101: SCA Crypto Accelerator */
    RSV86_IRQn, /* 0x66  0x0198 102: Reserved */
    FLC1_IRQn, /* 0x67  0x019C 103: Flash Controller 1 */
    UART3_IRQn, /* 0x68  0x01A0 104: UART 3 (LP) */
    RSV89_IRQn, /* 0x69  0x01A4 105: Reserved */
    RSV90_IRQn, /* 0x6A  0x01A8 106: Reserved */
    RSV91_IRQn, /* 0x6B  0x01AC 107: Reserved */
    RSV92_IRQn, /* 0x6C  0x01B0 108: Reserved */
    RSV93_IRQn, /* 0x6D  0x01B4 109: Reserved */
    RSV94_IRQn, /* 0x6E  0x01B8 110: Reserved */
    RSV95_IRQn, /* 0x6F  0x01BC 111: Reserved */
    RSV96_IRQn, /* 0x70  0x01C0 112: Reserved */
    RSV97_IRQn, /* 0x71  0x01C4 113: Reserved */
    RSV98_IRQn, /* 0x72  0x01C8 114: Reserved */
    I2S_IRQn, /* 0x73  0x01CC 115: I2S */
    RSV100_IRQn, /* 0x74  0x01D0 116: Reserved */
    RSV101_IRQn, /* 0x75  0x01D4 117: Reserved */
    RSV102_IRQn, /* 0x76  0x01D8 118: Reserved */
    LPCMP_IRQn, /* 0x77  0x01Dc 119: LP Comparator */
    RSV104_IRQn, /* 0x78  0x01E0  120: Reserved */
    SPI4_IRQn, /* 0x79  0x01E4  121: SPI4 */
    RSV106_IRQn, /* 0x7A  0x01E8  122: Reserved */
    CAN0_IRQn, /* 0x7B  0x01EC  123: CAN0 */
    CAN1_IRQn, /* 0x7C  0x01F0  124: CAN1 */
    WUT1_IRQn, /* 0x7D  0x01F4  125: Wake up timer 1 */
    RSV110_IRQn, /* 0x7E  0x01F8  126: Reserved */
    RSV111_IRQn, /* 0x7F  0x01FC  127: Reserved */
#else // __riscv
    HardFault_IRQn = 3, /* 0x03,3 HardFault */
    PF_IRQn = 4, /* 0x04,4 PFW | SYSFAULT | CM4 */
    WDT0_IRQn, /* 0x05,5 Watchdog 0 */
    GPIOWAKE_IRQn = 6, /* 0x06,6 GPIO Wakeup */
    AINComp_IRQn = 6, /* 0x06,6 Analog In Comparator */
    RTC_IRQn, /* 0x07,7 RTC */
    TMR0_IRQn, /* 0x08,8 Timer 0 */
    TMR1_IRQn, /* 0x09,9 Timer 1 */
    TMR2_IRQn, /* 0x0A,10 Timer 2 */
    TMR3_IRQn, /* 0x0B,11 Timer 3 */
    TMR4_IRQn, /* 0x0C,12 Timer 4 (LP) */
    TMR5_IRQn, /* 0x0D,13 Timer 5 (LP) */
    I2C0_IRQn, /* 0x0E,14 I2C0 */
    UART0_IRQn, /* 0x0F,15 UART 0 */
    CM4_IRQn, /* 0x10,16 CM4 */
    I2C1_IRQn, /* 0x11,17 I2C1 */
    UART1_IRQn, /* 0x12,18 UART 1 */
    UART2_IRQn, /* 0x13,19 UART 2 */
    I2C2_IRQn, /* 0x14,20 I2C2 */
    UART3_IRQn, /* 0x15,21 LPUART */
    SPI0_IRQn, /* 0x16,22 SPI0 */
    WUT0_IRQn, /* 0x17,23 WUT0 */
    FLC1_IRQn, /* 0x18,24 Flash Controller 1 */
    GPIO0_IRQn, /* 0x19,25 GPIO0 */
    GPIO1_IRQn, /* 0x1A,26 GPIO1 */
    GPIO3_IRQn, /* 0x1B,27 GPIO3 (LP) */
    DMA0_IRQn, /* 0x1C,28 DMA0 */
    DMA1_IRQn, /* 0x1D,29 DMA1 */
    DMA2_IRQn, /* 0x1E,30 DMA2 */
    DMA3_IRQn, /* 0x1F,31 DMA3 */
    BTLE_TX_DONE_IRQn, /* 0x20,32 Reserved */
    BTLE_RX_RCVD_IRQn, /* 0x21,33 Reserved */
    BTLE_RX_ENG_DET_IRQn, /* 0x22,34 Reserved */
    BTLE_SFD_DET_IRQn, /* 0x23,35 Reserved */
    BTLE_SFD_TO_IRQn, /* 0x24,36 Reserved */
    BTLE_GP_EVENT_IRQn, /* 0x25,37 Reserved */
    BTLE_CFO_IRQn, /* 0x26,38 Reserved */
    BTLE_SIG_DET_IRQn, /* 0x27,39 Reserved */
    BTLE_AGC_EVENT_IRQn, /* 0x28,40 Reserved */
    BTLE_RFFE_SPIM_IRQn, /* 0x29,41 Reserved */
    BTLE_TX_AES_IRQn, /* 0x2A,42 Reserved */
    BTLE_RX_AES_IRQn, /* 0x2B,43 Reserved */
    BTLE_INV_APB_ADDR_IRQn, /* 0x2C,44 Reserved */
    BTLE_IQ_DATA_VALID_IRQn, /* 0x2D,45 Reserved */
    DMA4_15_IRQn, /* 0x2E,46 DMA4 - 15  */
    TRNG_IRQn, /* 0x2F,47 True Random Number Generator */
    WDT1_IRQn, /* 0x30,48 Watchdog 1 (LP) */
    RSV49_IRQn, /* 0x31,49 Reserved */
    RSV50_IRQn, /* 0x32,50 Reserved */
    WUT1_IRQn, /* 0x33,51 WUT1  */
    PT_IRQn, /* 0x34,52 Pulse train */
    ADC_IRQn, /* 0x35,53 ADC */
    OWM_IRQn, /* 0x36,54 One Wire Master */
    I2S_IRQn, /* 0x37,55 I2S */
    RSV56_IRQn, /* 0x38,56 Reserved */
    RSV57_IRQn, /* 0x39,57 Reserved  */
    CAN0_IRQn, /* 0x3A,58 CAN0  */
    RSV59_IRQn, /* 0x3B,59 Reserved */
    GPIO2_IRQn, /* 0x3C,60 GPIO2 */
    SPI1_IRQn, /* 0x3D,61 SPI1  */
    SPI2_IRQn, /* 0x3E,62 SPI2  */
    CAN1_IRQn, /* 0x3F,63 CAN1 */
#endif // __riscv
    MXC_IRQ_EXT_COUNT,
} IRQn_Type;

